2021/org/week1.tex
% Created 2021-02-24 三 14:48
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{lijin}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={lijin},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode )}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{{\bfseries\sffamily TODO} (2018 USENIX)Injected and Delivered: Fabricating Implicit Control over Actuation Systems by Spoofing Inertial Sensors}
\label{sec:org150decb}
\subsection{{\bfseries\sffamily DONE} Summary}
\label{sec:orgf0aed94}
In this paper, the author utilize the resonance effect of MEMS inertial sensors to devise two different non-invasive spoofing attack toward embedded sensors. To conduct these attacks, the authors analyze the sampling process and find the way to control the digital signal output via changing the acoustic signal's amplitude, frequency and phase. To assess the performance of these attacks, the authors evaluate their attacks on 25 different devices and find 23 of them affected by the acoustic signal.
\subsection{{\bfseries\sffamily DONE} Challenge}
\label{sec:org2663060}
Previous works have utilized the ultrasound signal to attack the MEMS sensors in UAVs, however, they have a couple of deficiencies which are the main challenge of this paper.
\begin{enumerate}
\item The output of the inertial sensors are digital signals sampled from the analog signal generated by resonance and in real scenarios the sample rate of the ADC converters have some drift. The authors find that even little drift can affect the output of sensors significantly. So to control the output, the drift in sampling rate must be considered.
\end{enumerate}
\subsection{{\bfseries\sffamily TODO} Main Idea}
\label{sec:orga71b3d9}

\subsection{{\bfseries\sffamily TODO} Strength}
\label{sec:org85cc33e}
\subsection{{\bfseries\sffamily TODO} Weakness}
\label{sec:orgb35a96c}

\section{(2019 Wireless Communication)Localization and navigation in autonomous driving: Threats and countermeasures}
\label{sec:org2c0331c}
\subsection{Solved Problem}
\label{sec:orgd229c9e}
The paper contains two major parts.
\begin{itemize}
\item In the first part the authors make a comprehensive survey toward security vulnerabilities in today's state-of-art navigation and localization technologies.
\item In the second part, the authors devise a novel route spoofing attack by injecting malicious code to modify the parameter of the route planning function in navigation apps.
\end{itemize}
\subsection{Main Idea}
\label{sec:org8a9e5ff}
The authors first construct a taxonomy about differentattacks on localization and navigation system. The maincomponents in these two systems are GPS and HD map. So,the authors classify different attacks base on their targetcomponent. For each sort of attack, the authors also discuss the countermeasures toward it.
\end{document}
